app/controllers/goods_controller.rb

  def index
    @goods = Good.all
---
SELECT "goods".* FROM "goods"

  def new
    if Good.count <= 10
---
SELECT COUNT(*) FROM "goods"

  def create

    @good = Good.new(good_params)
    if @good.save
---
INSERT INTO "goods" ("name", "description", "initial_value", "current_value", "purchase_date", "last_modification_date", "created_at", "updated_at", "type_good") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)

  def update
    if @good.update(good_params)
---
UPDATE "goods" SET "last_modification_date" = ?, "updated_at" = ? WHERE "goods"."id" = ?  [["last_modification_date", "2019-02-11"], ["updated_at", "2019-02-11 15:27:14.427063"], ["id", 12]]

  def destroy
    if @good.destroy
---
DELETE FROM "goods" WHERE "goods"."id" = ?  [["id", 6]]

  def set_good
    @good = Good.find(params[:id])
---
SELECT  "goods".* FROM "goods" WHERE "goods"."id" = ? LIMIT ?  [["id", 11], ["LIMIT", 1]]